def show_menu():
    print(
          "+-------------------------------------------+\n"
          "| Меню телефонного справочника:             |\n"
          "+-------------------------------------------+\n"
          "| 1. Отобразить весь справочник             |\n"
          "+-------------------------------------------+\n"
          "| 2. Найти абонента по фамилии              |\n"
          "+-------------------------------------------+\n"
          "| 3. Найти абонента по номеру телефона      |\n"
          "+-------------------------------------------+\n"
          "| 4. Изменить данные абонента в справочнике |\n"
          "+-------------------------------------------+\n"
          "| 5. Добавить абонента в справочник         |\n"
          "+-------------------------------------------+\n"
          "| 6. Удалить абонента из справочника        |\n"
          "+-------------------------------------------+\n"
          "| 7. Закончить работу                       |\n"
          "+-------------------------------------------+\n")

    choice = int(input('Введите раздел меню справочника: '))
    
    return choice